; domain
(define (domain parking)
 (:requirements :strips :typing)
 (:types car curb)
 (:predicates 
    (at-curb ?car - car) 
    (at-curb-num ?car - car ?curb - curb)
    (behind-car ?car ?front-car - car)
    (car-clear ?car - car) 
    (curb-clear ?curb - curb)
 )

	(:action move-curb-to-curb
		:parameters (?o1 - car ?o2 ?o3 - curb)
		:precondition (and 
			(car-clear ?o1)
			(curb-clear ?o3)
			(at-curb-num ?o1 ?o2)
		)
		:effect (and 
			(not (curb-clear ?o3))
			(curb-clear ?o2)
			(at-curb-num ?o1 ?o3)
			(not (at-curb-num ?o1 ?o2))
		)
	)

	(:action move-curb-to-car
		:parameters (?o1 - car ?o2 - curb ?o3 - car)
		:precondition (and 
			(car-clear ?o1)
			(car-clear ?o3)
			(at-curb-num ?o1 ?o2)
			(at-curb ?o3) 
		)
		:effect (and 
			(not (car-clear ?o3))
			(curb-clear ?o2)
			(behind-car ?o1 ?o3)
			(not (at-curb-num ?o1 ?o2))
			(not (at-curb ?o1))
		)
	)

	(:action move-car-to-curb
		:parameters (?o1 - car ?o2 - car ?o3 - curb)
		:precondition (and 
			(car-clear ?o1)
			(curb-clear ?o3)
			(behind-car ?o1 ?o2)
		)
		:effect (and 
			(not (curb-clear ?o3))
			(car-clear ?o2)
			(at-curb-num ?o1 ?o3)
			(not (behind-car ?o1 ?o2))
			(at-curb ?o1)
		)
	)

	(:action move-car-to-car
		:parameters (?o1 ?o2 ?o3 - car)
		:precondition (and 
			(car-clear ?o1)
			(car-clear ?o3)
			(behind-car ?o1 ?o2)
			(at-curb ?o3) 
		)
		:effect (and 
			(not (car-clear ?o3))
			(car-clear ?o2)
			(behind-car ?o1 ?o3)
			(not (behind-car ?o1 ?o2))
		)
	)
)

; problem
(define (problem parking1)
  (:domain parking)
  (:objects car_0 -  car car_1 -  car car_3 -  car car_4 -  car car_2 -  car curb_0 -  curb car_5 -  car curb_1 -  curb curb_2 -  curb curb_3 -  curb )
  (:init (car-clear car_1) (at-curb-num car_4 curb_1) (at-curb car_4) (car-clear car_2) (at-curb-num car_5 curb_0) (at-curb car_5) (at-curb-num car_3 curb_3) (at-curb car_3) (car-clear car_0) (behind-car car_1 car_3) (behind-car car_0 car_5) (car-clear car_4) (at-curb-num car_2 curb_2) (at-curb car_2) )
  (:goal (and (car-clear car_1)(at-curb-num car_3 curb_3)(at-curb car_3)(at-curb-num car_2 curb_2)(at-curb car_2)(car-clear car_5)(behind-car car_1 car_2)(behind-car car_5 car_3)(car-clear car_4)(at-curb-num car_0 curb_0)(at-curb car_0)(curb-clear curb_1)(behind-car car_4 car_0)(not (at-curb car_1))(not (at-curb car_4))(not (at-curb car_5))(not (at-curb-num car_0 curb_1))(not (at-curb-num car_0 curb_2))(not (at-curb-num car_0 curb_3))(not (at-curb-num car_1 curb_0))(not (at-curb-num car_1 curb_1))(not (at-curb-num car_1 curb_2))(not (at-curb-num car_1 curb_3))(not (at-curb-num car_2 curb_0))(not (at-curb-num car_2 curb_1))(not (at-curb-num car_2 curb_3))(not (at-curb-num car_3 curb_0))(not (at-curb-num car_3 curb_1))(not (at-curb-num car_3 curb_2))(not (at-curb-num car_4 curb_0))(not (at-curb-num car_4 curb_1))(not (at-curb-num car_4 curb_2))(not (at-curb-num car_4 curb_3))(not (at-curb-num car_5 curb_0))(not (at-curb-num car_5 curb_1))(not (at-curb-num car_5 curb_2))(not (at-curb-num car_5 curb_3))(not (behind-car car_0 car_0))(not (behind-car car_0 car_1))(not (behind-car car_0 car_2))(not (behind-car car_0 car_3))(not (behind-car car_0 car_4))(not (behind-car car_0 car_5))(not (behind-car car_1 car_0))(not (behind-car car_1 car_1))(not (behind-car car_1 car_3))(not (behind-car car_1 car_4))(not (behind-car car_1 car_5))(not (behind-car car_2 car_0))(not (behind-car car_2 car_1))(not (behind-car car_2 car_2))(not (behind-car car_2 car_3))(not (behind-car car_2 car_4))(not (behind-car car_2 car_5))(not (behind-car car_3 car_0))(not (behind-car car_3 car_1))(not (behind-car car_3 car_2))(not (behind-car car_3 car_3))(not (behind-car car_3 car_4))(not (behind-car car_3 car_5))(not (behind-car car_4 car_1))(not (behind-car car_4 car_2))(not (behind-car car_4 car_3))(not (behind-car car_4 car_4))(not (behind-car car_4 car_5))(not (behind-car car_5 car_0))(not (behind-car car_5 car_1))(not (behind-car car_5 car_2))(not (behind-car car_5 car_4))(not (behind-car car_5 car_5))(not (car-clear car_0))(not (car-clear car_2))(not (car-clear car_3))(not (curb-clear curb_0))(not (curb-clear curb_2))(not (curb-clear curb_3)))))

; plan
1. (move-car-to-car car_0 car_5 car_4)
   deleted: (car-clear car_4) (behind-car car_0 car_5)
   added: (car-clear car_5) (behind-car car_0 car_4)
   goals met: 61 of 76
2. (move-car-to-car car_1 car_3 car_2)
   deleted: (car-clear car_2) (behind-car car_1 car_3)
   added: (car-clear car_3) (behind-car car_1 car_2)
   goals met: 63 of 76
3. (move-curb-to-car car_5 curb_0 car_3)
   deleted: (car-clear car_3) (at-curb-num car_5 curb_0) (at-curb car_5)
   added: (curb-clear curb_0) (behind-car car_5 car_3)
   goals met: 66 of 76
4. (move-car-to-curb car_0 car_4 curb_0)
   deleted: (curb-clear curb_0) (behind-car car_0 car_4)
   added: (car-clear car_4) (at-curb-num car_0 curb_0) (at-curb car_0)
   goals met: 71 of 76
5. (move-curb-to-car car_4 curb_1 car_0)
   deleted: (car-clear car_0) (at-curb-num car_4 curb_1) (at-curb car_4)
   added: (curb-clear curb_1) (behind-car car_4 car_0)
   goals met: 76 of 76
